In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
sql_select = "SELECT * FROM search2"

In [3]:
engine = create_engine('mysql+pymysql://antimeteo:2392lampiriS@db56.grserver.gr:3306/FORECASTS?charset=utf8')

In [4]:
ll_table = pd.read_sql(sql_select, engine)

In [5]:
ll_table.head()

   ID  HOURSinced  T2m  RH  Wind_intensity  Wind_dir  WT
0   0     1034190   17  81               3       297   1
1   0     1034191   17  82               3       297   1
2   0     1034192   17  83               4       297   1
3   0     1034193   17  83               4       297   1
4   0     1034194   17  83               4       297   1

In [6]:
new_table = pd.read_table('./weatherspot.txt',  header=None)

In [7]:
new_table.columns = ['ID' , 'HOURSinced', 'T2m', 'RH', 'Wind_intensity', 'Wind_dir', 'WT']

In [8]:
new_table.head()

   ID  HOURSinced  T2m  RH  Wind_intensity  Wind_dir  WT
0   0     1034214   18  81               5       285   1
1   0     1034215   18  80               5       291   1
2   0     1034216   18  81               5       294   1
3   0     1034217   18  81               5       296   1
4   0     1034218   17  81               5       300   1

In [17]:
new_df = pd.merge(ll_table,new_table, how='left', on=['ID', 'HOURSinced'])

In [18]:
new_df.head(n=5)

,ID,HOURSinced,T2m_x,RH_x,Wind_intensity_x,Wind_dir_x,WT_x,T2m_y,RH_y,Wind_intensity_y,Wind_dir_y,WT_y
0,0,1034190,17,81,3,297,1,NaN,NaN,NaN,NaN,NaN
1,0,1034191,17,82,3,297,1,NaN,NaN,NaN,NaN,NaN
2,0,1034192,17,83,4,297,1,NaN,NaN,NaN,NaN,NaN
3,0,1034193,17,83,4,297,1,NaN,NaN,NaN,NaN,NaN
4,0,1034194,17,83,4,297,1,NaN,NaN,NaN,NaN,NaN

In [19]:
new_df['T2m'] = new_df['T2m_y'].fillna(new_df['T2m_x']).astype(int)

In [20]:
new_df['RH'] = new_df['RH_y'].fillna(new_df['RH_x']).astype(int)
new_df['Wind_intensity'] = new_df['Wind_intensity_y'].fillna(new_df['Wind_intensity_x']).astype(int)
new_df['Wind_dir'] = new_df['Wind_dir_y'].fillna(new_df['Wind_dir_x']).astype(int)
new_df['WT'] = new_df['WT_y'].fillna(new_df['WT_x']).astype(int)

In [21]:
final = new_df.drop(['T2m_y', 'T2m_x', 'RH_y', 'RH_x', 'Wind_intensity_y',
            'Wind_intensity_x', 'Wind_dir_y', 'Wind_dir_x', 
             'WT_y', 'WT_x'] , axis=1)

In [22]:
final.head()

   ID  HOURSinced  T2m  RH  Wind_intensity  Wind_dir  WT
0   0     1034190   17  81               3       297   1
1   0     1034191   17  82               3       297   1
2   0     1034192   17  83               4       297   1
3   0     1034193   17  83               4       297   1
4   0     1034194   17  83               4       297   1

In [29]:
del data_tp

In [24]:
sql_delete = "DELETE FROM search2"

In [27]:
engine.execute(sql_delete)

In [30]:
data_tp = str([tuple(prod) for prod in final.values]).strip('[]')

In [31]:
sql_update = "INSERT INTO search2 (ID, HOURSinced, T2m, RH, \
                Wind_intensity, Wind_dir, WT) VALUES " + data_tp

In [ ]:
f = open(writePath, 'a')

In [ ]:
a=1